[
    {
        "title": ", SEVENTH PARLIA",
        "text": ", 15 AUGUST 2024 ANNOUNCEMENT The Speaker: Referral of document to committee in terms of section 52 of the Financial Management of Parliament and Provincial Legislatures Act, 2009 (Act 10 of 2009), as amended"
    },
    {
        "title": ", SEVENTH PARLIA",
        "text": ", 20 AUGUST 2024 ANNOUNCEMENT The Speaker: Provincial Notice 83 of 2024: Local Government : Municipal Finance Management Act : Quarterly Consolidate d Statement : Quarter 4 Ending"
    },
    {
        "title": ", SEVENTH PARLIA",
        "text": ", 30 AUGUST 2024 TABLING The S peaker : Depistage of document for the financial year ended 31 March 202 4 in terms of section 60 of the Financial Management of Parliament and Provincial Legislature"
    },
    {
        "title": "Older Persons Amendment Bill",
        "text": ", 4 SEPTEMBER 2024 ANNOUNCEMENT The Speaker: Referral of a bill to committees in accordance with Rule 217: Standing Committee on Social Development Older Persons Amendment Bill [B 11"
    },
    {
        "title": "- 2024] FIRST SESS",
        "text": ": (a) What specific measures and policies does his administration have in place to (a) ensure that all allegations of sexual harassment and misconduct by government employees, especially those in senior positions, are thoroughly investigated in timely manner. ("
    },
    {
        "title": ", SEVENTH PARLIA",
        "text": "withdrawn 6 QUESTION S FOR ORAL REPLY Questions standing over from Thursday, 22 August 2024. (77) 3. Ms A Cassiem to ask Ms A J D Marais, Minister of"
    },
    {
        "title": "- 2024] 31 No 5",
        "text": ", 22 AUGUST 2024 1. The House met at 14:15. 2. The Speaker took the Chair and read the prayer. 3. [14:15 ] The Speaker made a general announcement regarding the logistical arrangements for the"
    },
    {
        "title": ", SEVENTH PARLIA",
        "text": ",,, SEWENDE PARLEMENT PARLEMENT VAN DIE PROVINSIE WES -KAAP ================"
    },
    {
        "title": "] FIRST SESSION, SE",
        "text": "- - 9 No 6 - 2024 HOUSE: 14:15 QUESTIONS TO THE PREMIER WITHOUT NOTICE Mr M K Sayed Mr B Petrus Ms D R Stephens Mr"
    },
    {
        "title": ", SEVENTH PARLIA",
        "text": "the House, considering the serious allegations and ongoing legal proceedings involving Mr Farrell Payne, a senior manager in the Department of Mobility, facing charges of sexual misconduct involving a junior female employ ee. Ms"
    }
]